# Data Wrangling

## Some Pandas Basics
A Dataframe can be best seen as a collection of Series.

In [180]:
import pandas as pd
import numpy as np

```python
#create DF from a file
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

#read data from a SQL Database
sql_df   = pd.read_sql_table('my_table', engine, columns=['ColA', 'ColB'])

xls_df   = pd.read_excel('my_dataset.xlsx', 'Sheet1', na_values=['NA', '?'])
json_df  = pd.read_json('my_dataset.json', orient='columns')
csv_df   = pd.read_csv('my_dataset.csv', sep=',')

#loads all HTML tables into a list of DataFrames
html_df = pd.read_html('http://page.com/with/table.html')[0]

#writing dataframe back to disk
sql_df.to_sql('table', engine)
xls_df.to_excel('dataset.xlsx')
json_df.to_json('dataset.json')
csv_df.to_csv('dataset.csv')
```

In [181]:
#create df from dicts
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [182]:
#create DF from Random data
my_df = pd.DataFrame(np.random.randn(10,4))
my_df

          0         1         2         3
0 -0.593212  1.513728  1.515370  0.831597
1 -0.215166  1.754877  0.117525 -0.286451
2 -0.511753  0.113772  0.823452 -1.262135
3 -0.652124 -1.123031 -0.465660  0.095143
4 -0.413981  0.667926 -0.286987 -0.868420
5 -0.371114 -1.223530  0.010699  0.006723
6 -0.230240  0.814329 -0.541985 -0.924895
7 -2.189982 -2.458453  0.647392  1.698724
8 -0.057120 -0.559744  0.396550 -0.338798
9  0.373414  1.695160 -1.415639  0.663475

In [183]:
#View columns
my_df.columns

RangeIndex(start=0, stop=4, step=1)

In [184]:
#rename columns
my_df.columns = ['c1', 'c2', 'c3', 'c4']
my_df.columns

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [185]:
#head of data
my_df.head(3)

         c1        c2        c3        c4
0 -0.593212  1.513728  1.515370  0.831597
1 -0.215166  1.754877  0.117525 -0.286451
2 -0.511753  0.113772  0.823452 -1.262135

In [186]:
#tail of data
my_df.tail(3)

         c1        c2        c3        c4
7 -2.189982 -2.458453  0.647392  1.698724
8 -0.057120 -0.559744  0.396550 -0.338798
9  0.373414  1.695160 -1.415639  0.663475

In [187]:
#summary statistics
my_df.describe()

              c1         c2         c3         c4
count  10.000000  10.000000  10.000000  10.000000
mean   -0.486128   0.119503   0.080072  -0.038504
std     0.668580   1.427486   0.823109   0.907444
min    -2.189982  -2.458453  -1.415639  -1.262135
25%    -0.572847  -0.982209  -0.420992  -0.736015
50%    -0.392548   0.390849   0.064112  -0.139864
75%    -0.218934   1.338878   0.584681   0.521392
max     0.373414   1.754877   1.515370   1.698724

In [188]:
#view indices
my_df.index

RangeIndex(start=0, stop=10, step=1)

In [189]:
#view df types
#objects are strings
my_df.dtypes

c1    float64
c2    float64
c3    float64
c4    float64
dtype: object

In [190]:
#transpose dataframe
my_df.T

,0,1,2,3,4,5,6,7,8,9
c1,-0.593212,-0.215166,-0.511753,-0.652124,-0.413981,-0.371114,-0.230240,-2.189982,-0.057120,0.373414
c2,1.513728,1.754877,0.113772,-1.123031,0.667926,-1.223530,0.814329,-2.458453,-0.559744,1.695160
c3,1.515370,0.117525,0.823452,-0.465660,-0.286987,0.010699,-0.541985,0.647392,0.396550,-1.415639
c4,0.831597,-0.286451,-1.262135,0.095143,-0.868420,0.006723,-0.924895,1.698724,-0.338798,0.663475

In [191]:
my_df.sort_values(by='c1')

         c1        c2        c3        c4
7 -2.189982 -2.458453  0.647392  1.698724
3 -0.652124 -1.123031 -0.465660  0.095143
0 -0.593212  1.513728  1.515370  0.831597
2 -0.511753  0.113772  0.823452 -1.262135
4 -0.413981  0.667926 -0.286987 -0.868420
5 -0.371114 -1.223530  0.010699  0.006723
6 -0.230240  0.814329 -0.541985 -0.924895
1 -0.215166  1.754877  0.117525 -0.286451
8 -0.057120 -0.559744  0.396550 -0.338798
9  0.373414  1.695160 -1.415639  0.663475

In [192]:
#slicing and dicing

#returns series
my_df.c1
#returns series
my_df['c1']

#returns dataframe
my_df[['c1']]

#loc is inclusive of end value range
#returns series
my_df.loc[:, 'c1']
#returns dataframe
my_df.loc[:, ['c1']]

#iloc is exclusive of end value range
#returns series
my_df.iloc[:, 0]
#returns dataframe
my_df.iloc[:, [0]]

my_df[0:2]
my_df.iloc[0:2, :]

print(type(my_df.c1))
print(type(my_df['c1']))
print(type(my_df[['c1']]))
print(type(my_df.loc[:, 'c1']))
print(type(my_df.loc[:, ['c1']]))
print(type(my_df.iloc[:, 0]))
print(type(my_df.iloc[:, [0]]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [193]:
#Boolean indexing
#Can be further combined using bitwise operators
bool_df = my_df[(my_df.c1 > 1) & (my_df.c2 < 1)]
bool_df

Empty DataFrame
Columns: [c1, c2, c3, c4]
Index: []

In [194]:
#writing to a slice
#be sure to write data on a per column basis because of homogeneous column datatypes
my_df.loc[my_df.c1 < 1, ['c4']] = 1
my_df

         c1        c2        c3   c4
0 -0.593212  1.513728  1.515370  1.0
1 -0.215166  1.754877  0.117525  1.0
2 -0.511753  0.113772  0.823452  1.0
3 -0.652124 -1.123031 -0.465660  1.0
4 -0.413981  0.667926 -0.286987  1.0
5 -0.371114 -1.223530  0.010699  1.0
6 -0.230240  0.814329 -0.541985  1.0
7 -2.189982 -2.458453  0.647392  1.0
8 -0.057120 -0.559744  0.396550  1.0
9  0.373414  1.695160 -1.415639  1.0

In [195]:
#using isin method for filtering
my_df2 = my_df.copy()
my_df2['E'] = ['one', 'one','two','three','four','three','five','six','seven','eight']
my_df2[my_df2['E'].isin(['two','four'])] = np.nan
my_df2

         c1        c2        c3   c4      E
0 -0.593212  1.513728  1.515370  1.0    one
1 -0.215166  1.754877  0.117525  1.0    one
2       NaN       NaN       NaN  NaN    NaN
3 -0.652124 -1.123031 -0.465660  1.0  three
4       NaN       NaN       NaN  NaN    NaN
5 -0.371114 -1.223530  0.010699  1.0  three
6 -0.230240  0.814329 -0.541985  1.0   five
7 -2.189982 -2.458453  0.647392  1.0    six
8 -0.057120 -0.559744  0.396550  1.0  seven
9  0.373414  1.695160 -1.415639  1.0  eight

In [224]:
#concat dataframes
df3 = pd.DataFrame(np.random.randn(10, 4))
pieces = [df3[:3], df3[3:7], df3[7:]]
#you can also concat on axis=1 which is columns instead of rows
pd.concat(pieces, ignore_index=False)

          0         1         2         3
0  1.221641 -1.166735  0.007091 -1.512233
1  0.384528 -0.351647  0.983974 -1.033953
2  0.361655  1.609738 -0.715783 -0.607186
3  0.041159 -0.596922 -1.436412 -2.038551
4  0.081198 -0.402377  0.885750  0.917110
5 -1.228755  1.050762 -0.294136 -1.629294
6 -0.490925  1.074962  0.282344 -0.174371
7  0.368238 -0.333819  0.723307 -1.899953
8 -0.116597  0.729680  1.050813 -0.248072
9 -0.653862 -0.472213  0.186784 -1.261652

In [215]:
#Append rows
df4 = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
s4 = df4.iloc[3]
df4.append(s4, ignore_index=False)
#you can also append dataframe to conconcat them on rows

          A         B         C         D
0 -2.228703 -1.459777 -0.308691  1.663862
1  0.530499 -0.929365  0.626169  0.696879
2 -1.422595  0.997245  0.607965  0.400710
3 -1.207092 -0.195603  0.753427  0.331743
4  2.754891 -1.698074  0.018116 -0.145845
5  0.705046  0.799667 -0.928058  0.293137
6 -0.138505 -0.162450 -1.282897 -0.493378
7 -0.719336 -0.209045  0.212075  0.772045
3 -1.207092 -0.195603  0.753427  0.331743

In [212]:
#joining
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

## Drop duplicates

In [197]:
my_df2.drop_duplicates()

         c1        c2        c3   c4      E
0 -0.593212  1.513728  1.515370  1.0    one
1 -0.215166  1.754877  0.117525  1.0    one
2       NaN       NaN       NaN  NaN    NaN
3 -0.652124 -1.123031 -0.465660  1.0  three
5 -0.371114 -1.223530  0.010699  1.0  three
6 -0.230240  0.814329 -0.541985  1.0   five
7 -2.189982 -2.458453  0.647392  1.0    six
8 -0.057120 -0.559744  0.396550  1.0  seven
9  0.373414  1.695160 -1.415639  1.0  eight

## Detecting and replacing missing values

In [198]:
#get boolean values where dataframe is null
my_df2.isnull()

      c1     c2     c3     c4      E
0  False  False  False  False  False
1  False  False  False  False  False
2   True   True   True   True   True
3  False  False  False  False  False
4   True   True   True   True   True
5  False  False  False  False  False
6  False  False  False  False  False
7  False  False  False  False  False
8  False  False  False  False  False
9  False  False  False  False  False

In [199]:
#drop missing data
my_df2.dropna()

         c1        c2        c3   c4      E
0 -0.593212  1.513728  1.515370  1.0    one
1 -0.215166  1.754877  0.117525  1.0    one
3 -0.652124 -1.123031 -0.465660  1.0  three
5 -0.371114 -1.223530  0.010699  1.0  three
6 -0.230240  0.814329 -0.541985  1.0   five
7 -2.189982 -2.458453  0.647392  1.0    six
8 -0.057120 -0.559744  0.396550  1.0  seven
9  0.373414  1.695160 -1.415639  1.0  eight

In [200]:
#filling missing datab
my_df2.fillna(value=3)

         c1        c2        c3   c4      E
0 -0.593212  1.513728  1.515370  1.0    one
1 -0.215166  1.754877  0.117525  1.0    one
2  3.000000  3.000000  3.000000  3.0      3
3 -0.652124 -1.123031 -0.465660  1.0  three
4  3.000000  3.000000  3.000000  3.0      3
5 -0.371114 -1.223530  0.010699  1.0  three
6 -0.230240  0.814329 -0.541985  1.0   five
7 -2.189982 -2.458453  0.647392  1.0    six
8 -0.057120 -0.559744  0.396550  1.0  seven
9  0.373414  1.695160 -1.415639  1.0  eight

In [201]:
#forward fill
my_df2.ffill()

         c1        c2        c3   c4      E
0 -0.593212  1.513728  1.515370  1.0    one
1 -0.215166  1.754877  0.117525  1.0    one
2 -0.215166  1.754877  0.117525  1.0    one
3 -0.652124 -1.123031 -0.465660  1.0  three
4 -0.652124 -1.123031 -0.465660  1.0  three
5 -0.371114 -1.223530  0.010699  1.0  three
6 -0.230240  0.814329 -0.541985  1.0   five
7 -2.189982 -2.458453  0.647392  1.0    six
8 -0.057120 -0.559744  0.396550  1.0  seven
9  0.373414  1.695160 -1.415639  1.0  eight

In [202]:
#backward fill
my_df2.bfill()

         c1        c2        c3   c4      E
0 -0.593212  1.513728  1.515370  1.0    one
1 -0.215166  1.754877  0.117525  1.0    one
2 -0.652124 -1.123031 -0.465660  1.0  three
3 -0.652124 -1.123031 -0.465660  1.0  three
4 -0.371114 -1.223530  0.010699  1.0  three
5 -0.371114 -1.223530  0.010699  1.0  three
6 -0.230240  0.814329 -0.541985  1.0   five
7 -2.189982 -2.458453  0.647392  1.0    six
8 -0.057120 -0.559744  0.396550  1.0  seven
9  0.373414  1.695160 -1.415639  1.0  eight

In [203]:
#interpolate
my_df2.interpolate()

         c1        c2        c3   c4      E
0 -0.593212  1.513728  1.515370  1.0    one
1 -0.215166  1.754877  0.117525  1.0    one
2 -0.433645  0.315923 -0.174067  1.0    NaN
3 -0.652124 -1.123031 -0.465660  1.0  three
4 -0.511619 -1.173280 -0.227480  1.0    NaN
5 -0.371114 -1.223530  0.010699  1.0  three
6 -0.230240  0.814329 -0.541985  1.0   five
7 -2.189982 -2.458453  0.647392  1.0    six
8 -0.057120 -0.559744  0.396550  1.0  seven
9  0.373414  1.695160 -1.415639  1.0  eight

## Detecting outliers

In [ ]:
#use boolean indexing

## Categoricals

In [216]:
df3 = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [217]:
df3["grade"] = df3["raw_grade"].astype("category")
df3["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [218]:
df3["grade"].cat.categories = ["very good", "good", "very bad"]
df3["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

In [220]:
df3["grade"] = df3["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df3["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [221]:
df3.sort_values(by='grade')

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [223]:
df3.groupby('grade').size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

## Normalizing Data Sets

In [ ]:
#use sklearn preprocessing of numpy arrays
#so remember to convert to numpy arrays!

## Feature Engineering